guangli2015/google_fast_pair_location_tag_nRF5SDK_17_1_0/ble_gfp.c
        account_key_t data;
        for(int i=0;i<FP_CRYPTO_AES128_BLOCK_LEN;i++)
        {
          data.account_key[i] = raw_req_accountkey[i];
        }
        //print_hex("acckeyadd",raw_req_accountkey,16);
//test
        //uint8_t testacc[16]={0x4 , 0xa6 , 0xef , 0x67 , 0x5a , 0xb8 , 0xac , 0x2d , 0xd4 , 0x67 , 0x4f , 0xe8 , 0xbf , 0x6c , 0x4f , 0xf5};
        // for(int i=0;i<FP_CRYPTO_AES128_BLOCK_LEN;i++)
        //{
        //  data.account_key[i] = testacc[i];
        //}
        
        err_code = nrf_queue_push(&account_key_queue,&data);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_queue_push err %x\n",err_code);
        }

                      

    }
    else if ((p_evt_write->handle == p_gfp->addi_data_handles.value_handle) )
    {

         NRF_LOG_INFO("addi_data_handles################################\n");
                      

    }
    else if ((p_evt_write->handle == p_gfp->beacon_actions_handles.value_handle) )
    {NRF_LOG_INFO("beacon_actions_handles################################\n");
#if 0
       uint8_t data_id;
       uint8_t data_len;
       int ret;
       size_t  len_out_para_read;
       size_t  len_out_stat_read;
       size_t  len_out_eik_set;
       size_t  len_out_eik_clr;
       uint8_t rsp_buf_para_read[50];
       uint8_t rsp_buf_stat_read[20];
        uint8_t rsp_buf_eik_set[50];
         uint8_t rsp_buf_eik_clr[50];
          ble_gatts_hvx_params_t     hvx_params;
       //NRF_LOG_INFO("beacon_actions_handles################################\n");
       data_id = p_evt_write->data[0];
       data_len = p_evt_write->data[1];
       switch (data_id) 
       {
	case BEACON_ACTIONS_BEACON_PARAMETERS_READ:
                 len_out_para_read = BEACON_PARAMETERS_RSP_LEN;
		 beacon_parameters_read_handle(p_evt_write->data,p_evt_write->len,rsp_buf_para_read);
                 NRF_LOG_INFO("!!!!!!rsp_buf_para_read %x\n",len_out_para_read);
                 print_hex("!!!rsp_buf_para_read",rsp_buf_para_read,len_out_para_read);
                 //ble_gatts_hvx_params_t     hvx_params;
      
                 memset(&hvx_params, 0, sizeof(hvx_params));
                 //len_out = 1+1+8;
                 hvx_params.handle = p_gfp->beacon_actions_handles.value_handle;
                 hvx_params.p_data = rsp_buf_para_read;
                 hvx_params.p_len  = &len_out_para_read;
                 hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

                 err_code = sd_ble_gatts_hvx(p_ble_evt->evt.gatts_evt.conn_handle, &hvx_params);
                 if(NRF_SUCCESS != err_code)
                 {
                   NRF_LOG_ERROR("sd_ble_gatts_hvx err %x\n",err_code);
                 }
		break;
	case BEACON_ACTIONS_PROVISIONING_STATE_READ:
                  //len_out = PROVISIONING_STATE_RSP_LEN;
                  len_out_stat_read = beacon_provisioned ? PROVISIONING_STATE_RSP_LEN :
		(PROVISIONING_STATE_RSP_LEN - PROVISIONING_STATE_RSP_EID_LEN);
		 ret = provisioning_state_read_handle(p_evt_write->data,p_evt_write->len,rsp_buf_stat_read);
                 if(ret == -1)
                 {
                  
                 }
                 NRF_LOG_INFO("!!!!!!rsp_buf_stat_read %x\n",len_out_stat_read);
                 print_hex("!!!rsp_buf_stat_read",rsp_buf_stat_read,len_out_stat_read);
                 //ble_gatts_hvx_params_t     hvx_params;
      
                 memset(&hvx_params, 0, sizeof(hvx_params));
                 //len_out = 1+1+8;
                 hvx_params.handle = p_gfp->beacon_actions_handles.value_handle;
                 hvx_params.p_data = rsp_buf_stat_read;
                 hvx_params.p_len  = &len_out_stat_read;
                 hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

                 err_code = sd_ble_gatts_hvx(p_ble_evt->evt.gatts_evt.conn_handle, &hvx_params);
                 if(NRF_SUCCESS != err_code)
                 {
                   NRF_LOG_ERROR("sd_ble_gatts_hvx err %x\n",err_code);
                 }
		break;
	case BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_SET:
                len_out_eik_set = 1+1+8;
		ephemeral_identity_key_set_handle(p_evt_write->data,p_evt_write->len,rsp_buf_eik_set);

                 NRF_LOG_INFO("!!!!!!rsp_buf_eik_set %x\n",len_out_eik_set);
                 print_hex("!!!rsp_buf_eik_set",rsp_buf_eik_set,len_out_eik_set);
                 //ble_gatts_hvx_params_t     hvx_params;
      
                 memset(&hvx_params, 0, sizeof(hvx_params));
                 //len_out = 1+1+8;
                 hvx_params.handle = p_gfp->beacon_actions_handles.value_handle;
                 hvx_params.p_data = rsp_buf_eik_set;
                 hvx_params.p_len  = &len_out_eik_set;
                 hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

                 err_code = sd_ble_gatts_hvx(p_ble_evt->evt.gatts_evt.conn_handle, &hvx_params);
                 if(NRF_SUCCESS != err_code)
                 {
                   NRF_LOG_ERROR("sd_ble_gatts_hvx err %x\n",err_code);
                 }
		break;
	case BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_CLEAR:
                len_out_eik_clr = EPHEMERAL_IDENTITY_KEY_CLEAR_RSP_LEN;
		ephemeral_identity_key_clear_handle(p_evt_write->data,p_evt_write->len,rsp_buf_eik_clr);

                NRF_LOG_INFO("!!!!!!rsp_buf_eik_clr %x\n",len_out_eik_clr);
                 print_hex("!!!rsp_buf_eik_clr",rsp_buf_eik_clr,len_out_eik_clr);
                 //ble_gatts_hvx_params_t     hvx_params;
      
                 memset(&hvx_params, 0, sizeof(hvx_params));
                 //len_out = 1+1+8;
                 hvx_params.handle = p_gfp->beacon_actions_handles.value_handle;
                 hvx_params.p_data = rsp_buf_eik_clr;
                 hvx_params.p_len  = &len_out_eik_clr;
                 hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

                 err_code = sd_ble_gatts_hvx(p_ble_evt->evt.gatts_evt.conn_handle, &hvx_params);
                 if(NRF_SUCCESS != err_code)
                 {
                   NRF_LOG_ERROR("sd_ble_gatts_hvx err %x\n",err_code);
                 }
		break;
	case BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_READ:
		//res = ephemeral_identity_key_read_handle(conn, attr, &fmdn_beacon_actions_buf);
		break;
	case BEACON_ACTIONS_RING:
		//res = ring_handle(conn, attr, &fmdn_beacon_actions_buf);
		break;
	case BEACON_ACTIONS_RINGING_STATE_READ:
		//res = ringing_state_read_handle(conn, attr, &fmdn_beacon_actions_buf);
		break;
	case BEACON_ACTIONS_ACTIVATE_UTP_MODE:
		//res = activate_utp_mode_handle(conn, attr, &fmdn_beacon_actions_buf);
		break;
	case BEACON_ACTIONS_DEACTIVATE_UTP_MODE:
		//res = deactivate_utp_mode_handle(conn, attr, &fmdn_beacon_actions_buf);
		break;
	default:
		NRF_LOG_ERROR("Beacon Actions: unrecognized request: data_id=%d", data_id);
		
