guangli2015/google_fast_pair_location_tag_nRF5SDK_17_1_0/ble_gfp.c
	}
      //  NRF_LOG_INFO("!!!!!!len_out %x\n",len_out);
      //  print_hex("!!!rsp_buf",rsp_buf,len_out);
      //ble_gatts_hvx_params_t     hvx_params;
      
      //memset(&hvx_params, 0, sizeof(hvx_params));
      ////len_out = 1+1+8;
      //hvx_params.handle = p_gfp->beacon_actions_handles.value_handle;
      //hvx_params.p_data = rsp_buf1;
      //hvx_params.p_len  = &len_out;
      //hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

      //err_code = sd_ble_gatts_hvx(p_ble_evt->evt.gatts_evt.conn_handle, &hvx_params);
      //if(NRF_SUCCESS != err_code)
      //{
      //  NRF_LOG_ERROR("sd_ble_gatts_hvx err %x\n",err_code);
      //}

 #endif                     

    }
    else
    {
        // Do Nothing. This event is not relevant for this service.
    }
}
static uint8_t volatile rsp[1+8];
static void on_read(ble_gfp_t * p_gfp, ble_evt_t const * p_ble_evt)
{
    ble_gatts_evt_rw_authorize_request_t const * evt_rw_auth =
        &p_ble_evt->evt.gatts_evt.params.authorize_request;
    ble_gatts_rw_authorize_reply_params_t        auth_read_params;
        ble_gatts_rw_authorize_reply_params_t        auth_wr_params;
                  ret_code_t                                   err_code;

    //if (evt_rw_auth->type != BLE_GATTS_AUTHORIZE_TYPE_READ)
    //{
    //    // Unexpected operation
    //    NRF_LOG_INFO(" W_AUTHORIZE_REQUEST Unexpected operation \n");
    //    return;
    //}

    if (evt_rw_auth->type == BLE_GATTS_AUTHORIZE_TYPE_READ)
    {
      /* Update SD GATTS values of appropriate host before SD sends the Read Response */
      if (evt_rw_auth->request.read.handle == p_gfp->beacon_actions_handles.value_handle)
      {

             
          
              //ble_gatts_evt_rw_authorize_request_t const * p_read_auth =
              //  &p_ble_evt->evt.gatts_evt.params.authorize_request;

          NRF_LOG_INFO("ON W_AUTHORIZE_REQUEST read\n");

          err_code = nrf_crypto_rng_vector_generate(random_nonce, 8);
          if(NRF_SUCCESS != err_code)
          {
                NRF_LOG_ERROR("nrf_crypto_rng_vector_generate err %x\n",err_code);
          }
          rsp[0] = BT_FAST_PAIR_FMDN_VERSION_MAJOR;
          memcpy(rsp+1,random_nonce,8);
          print_hex("random_rsp",rsp,9);


          memset(&auth_read_params, 0, sizeof(auth_read_params));
          auth_read_params.type                    = BLE_GATTS_AUTHORIZE_TYPE_READ;
          auth_read_params.params.read.gatt_status = BLE_GATT_STATUS_SUCCESS;
          //auth_read_params.params.read.offset      = p_read_auth->request.read.offset;
          auth_read_params.params.read.offset      = 0;
          auth_read_params.params.read.len         = 9;
          auth_read_params.params.read.p_data      = rsp;
          auth_read_params.params.read.update      = 1;

          err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                     &auth_read_params);
          if(NRF_SUCCESS != err_code)
          {
                NRF_LOG_ERROR("sd_ble_gatts_rw_authorize_reply err %x\n",err_code);
          }
      }
    }
    else if(evt_rw_auth->type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
    {
        if (evt_rw_auth->request.write.handle == p_gfp->beacon_actions_handles.value_handle )
        {
           uint8_t data_id;
           uint8_t data_len;
           int ret;
           size_t  len_out_para_read;
           size_t  len_out_stat_read;
           size_t  len_out_eik_set;
           size_t  len_out_eik_clr;
           uint8_t rsp_buf_para_read[50];
           uint8_t rsp_buf_stat_read[20];
            uint8_t rsp_buf_eik_set[50];
             uint8_t rsp_buf_eik_clr[50];
              ble_gatts_hvx_params_t     hvx_params;
           NRF_LOG_INFO("ON W_AUTHORIZE_REQUEST write\n");
           data_id = evt_rw_auth->request.write.data[0];
           data_len = evt_rw_auth->request.write.data[1];

#if 1
           switch (data_id) 
           {
            case BEACON_ACTIONS_BEACON_PARAMETERS_READ:
                     len_out_para_read = BEACON_PARAMETERS_RSP_LEN;
                     beacon_parameters_read_handle(evt_rw_auth->request.write.data,evt_rw_auth->request.write.len,rsp_buf_para_read);
                     NRF_LOG_INFO("!!!!!!rsp_buf_para_read %x\n",len_out_para_read);
                     print_hex("!!!rsp_buf_para_read",rsp_buf_para_read,len_out_para_read);
                     //ble_gatts_hvx_params_t     hvx_params;
      
                     memset(&hvx_params, 0, sizeof(hvx_params));
                     //len_out = 1+1+8;
                     hvx_params.handle = p_gfp->beacon_actions_handles.value_handle;
                     hvx_params.p_data = rsp_buf_para_read;
                     hvx_params.p_len  = &len_out_para_read;
                     hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

                     err_code = sd_ble_gatts_hvx(p_ble_evt->evt.gatts_evt.conn_handle, &hvx_params);
                     if(NRF_SUCCESS != err_code)
                     {
                       NRF_LOG_ERROR("sd_ble_gatts_hvx err %x\n",err_code);
                     }
                    break;
            case BEACON_ACTIONS_PROVISIONING_STATE_READ:
                      //len_out = PROVISIONING_STATE_RSP_LEN;
                      len_out_stat_read = beacon_provisioned ? PROVISIONING_STATE_RSP_LEN :
                    (PROVISIONING_STATE_RSP_LEN - PROVISIONING_STATE_RSP_EID_LEN);
                     ret=provisioning_state_read_handle(evt_rw_auth->request.write.data,evt_rw_auth->request.write.len,rsp_buf_stat_read);
                     if(ret == -1)
                     {  NRF_LOG_INFO("stateerr\n");
                        memset(&auth_wr_params, 0, sizeof(auth_wr_params));
                        auth_wr_params.type                    = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                        auth_wr_params.params.write.gatt_status = 0x80;
                        //auth_read_params.params.read.offset      = p_read_auth->request.read.offset;
                        //auth_read_params.params.read.offset      = 0;
                        //auth_read_params.params.read.len         = 9;
                        //auth_read_params.params.read.p_data      = rsp;
                        //auth_read_params.params.read.update      = 1;
  
