guangli2015/google_fast_pair_location_tag_nRF5SDK_17_1_0/ble_gfp.c
                     }
                     else
                     {NRF_LOG_INFO("replysucc\n");
                         memset(&auth_wr_params, 0, sizeof(auth_wr_params));
                        auth_wr_params.type                    = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                        auth_wr_params.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
                     }
                     auth_wr_params.params.write.update = 1;

                     err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                                   &auth_wr_params);
                     if(NRF_SUCCESS != err_code)
                     {
                              NRF_LOG_ERROR("sd_ble_gatts_rw_authorize_reply err %x\n",err_code);
                     }
                     if(ret == -1)
                     {
                        return;
                     }

                     NRF_LOG_INFO("!!!!!!rsp_buf_stat_read %x\n",len_out_stat_read);
                     print_hex("!!!rsp_buf_stat_read",rsp_buf_stat_read,len_out_stat_read);
                     //ble_gatts_hvx_params_t     hvx_params;
      
                     memset(&hvx_params, 0, sizeof(hvx_params));
                     //len_out = 1+1+8;
                     hvx_params.handle = p_gfp->beacon_actions_handles.value_handle;
                     hvx_params.p_data = rsp_buf_stat_read;
                     hvx_params.p_len  = &len_out_stat_read;
                     hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

                     err_code = sd_ble_gatts_hvx(p_ble_evt->evt.gatts_evt.conn_handle, &hvx_params);

                     if(NRF_SUCCESS != err_code)
                     {
                       NRF_LOG_ERROR("sd_ble_gatts_hvx err %x\n",err_code);
                     }
                    break;
            case BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_SET:
                    len_out_eik_set = 1+1+8;
                    ephemeral_identity_key_set_handle(evt_rw_auth->request.write.data,evt_rw_auth->request.write.len,rsp_buf_eik_set);

                     NRF_LOG_INFO("!!!!!!rsp_buf_eik_set %x\n",len_out_eik_set);
                     print_hex("!!!rsp_buf_eik_set",rsp_buf_eik_set,len_out_eik_set);
                     //ble_gatts_hvx_params_t     hvx_params;
      
                     memset(&hvx_params, 0, sizeof(hvx_params));
                     //len_out = 1+1+8;
                     hvx_params.handle = p_gfp->beacon_actions_handles.value_handle;
                     hvx_params.p_data = rsp_buf_eik_set;
                     hvx_params.p_len  = &len_out_eik_set;
                     hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

                     err_code = sd_ble_gatts_hvx(p_ble_evt->evt.gatts_evt.conn_handle, &hvx_params);
                     if(NRF_SUCCESS != err_code)
                     {
                       NRF_LOG_ERROR("sd_ble_gatts_hvx err %x\n",err_code);
                     }
                    break;
            case BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_CLEAR:
                    len_out_eik_clr = EPHEMERAL_IDENTITY_KEY_CLEAR_RSP_LEN;
                    ephemeral_identity_key_clear_handle(evt_rw_auth->request.write.data,evt_rw_auth->request.write.len,rsp_buf_eik_clr);

                    NRF_LOG_INFO("!!!!!!rsp_buf_eik_clr %x\n",len_out_eik_clr);
                     print_hex("!!!rsp_buf_eik_clr",rsp_buf_eik_clr,len_out_eik_clr);
                     //ble_gatts_hvx_params_t     hvx_params;
      
                     memset(&hvx_params, 0, sizeof(hvx_params));
                     //len_out = 1+1+8;
                     hvx_params.handle = p_gfp->beacon_actions_handles.value_handle;
                     hvx_params.p_data = rsp_buf_eik_clr;
                     hvx_params.p_len  = &len_out_eik_clr;
                     hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

                     err_code = sd_ble_gatts_hvx(p_ble_evt->evt.gatts_evt.conn_handle, &hvx_params);
                     if(NRF_SUCCESS != err_code)
                     {
                       NRF_LOG_ERROR("sd_ble_gatts_hvx err %x\n",err_code);
                     }
                    break;
            case BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_READ:
                    //res = ephemeral_identity_key_read_handle(conn, attr, &fmdn_beacon_actions_buf);
                    break;
            case BEACON_ACTIONS_RING:
                    //res = ring_handle(conn, attr, &fmdn_beacon_actions_buf);
                    break;
            case BEACON_ACTIONS_RINGING_STATE_READ:
                    //res = ringing_state_read_handle(conn, attr, &fmdn_beacon_actions_buf);
                    
                    break;
            case BEACON_ACTIONS_ACTIVATE_UTP_MODE:
                    //res = activate_utp_mode_handle(conn, attr, &fmdn_beacon_actions_buf);
                    break;
            case BEACON_ACTIONS_DEACTIVATE_UTP_MODE:
                    //res = deactivate_utp_mode_handle(conn, attr, &fmdn_beacon_actions_buf);
                    break;
            default:
                    NRF_LOG_ERROR("Beacon Actions: unrecognized request: data_id=%d", data_id);
		
            }
#endif
          //  NRF_LOG_INFO("!!!!!!len_out %x\n",len_out);
          //  print_hex("!!!rsp_buf",rsp_buf,len_out);
          //ble_gatts_hvx_params_t     hvx_params;
      
          //memset(&hvx_params, 0, sizeof(hvx_params));
          ////len_out = 1+1+8;
          //hvx_params.handle = p_gfp->beacon_actions_handles.value_handle;
          //hvx_params.p_data = rsp_buf1;
          //hvx_params.p_len  = &len_out;
          //hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

          //err_code = sd_ble_gatts_hvx(p_ble_evt->evt.gatts_evt.conn_handle, &hvx_params);
          //if(NRF_SUCCESS != err_code)
          //{
          //  NRF_LOG_ERROR("sd_ble_gatts_hvx err %x\n",err_code);
          //}

                      

        }
    }
    
}

void ble_gfp_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{
    if ((p_context == NULL) || (p_ble_evt == NULL))
    {
        return;
    }

    ble_gfp_t * p_gfp = (ble_gfp_t *)p_context;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            //on_connect(p_gfp, p_ble_evt);
            break;

